cool/tutorials/compressible/rhoPorousSimpleFoam/porousPlug/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Re = 1 = rho=(rho U H)/mu; rho=1.144, mu=1.861e-5; H=0.01
internalField   uniform (1.62589e-4 0 0);

boundaryField
{
    inlet
    {
        // type            groovyBC;
        type fixedValue;
        variables "UTarget=1.62589e-4;yMax=max(pts().y);";
        valueExpression "vector(1,0,0)*6*UTarget*pos().y/yMax*(1-pos().y/yMax)";
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
